		g = c.getContext('2d');
		c.width = gW = window.innerWidth - 25;
		c.height = gH = window.innerHeight - 25;

		var key = [];
		document.onkeydown = function(e) {ctrl(e.which)}
		document.onkeyup = function(e) {ctrl(-e.which)}
		function ctrl(k) {key[k < 0 ? - k: k] = k > 0}

		var map = [
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,1,0,0,1,1,1,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1,0,0,1,1,0,1,0,1,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,1,0,0,1,0,1,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
			0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
		];
		var areaMap = []; // массив, в котором хранятся индексы видимых ячеек
		var mF0 = [], mF1 = [], mF2 = [], mF3 = [], mF4 = [], mF5 = [], mF6 = []; /* массивы слоев, 
		для отрисовки видио камере чести. Массивы представляют из себя несколько франтов, длинно от
		15ти до 3ех. Кажды следующий на 2 ячейки меньше (они по одной отсекаются по бокам) эти 
		массивы берут ныжные для отрисовки индекс из areaMap. В самих массивах хранятся номера ячеек, 
		которые они могут взять из areaMap. Для осущетвления ходьбы достаточно переместить видимую 
		область относительно Карты т.е. заскролить камеру, для осуществления поворота камеры надо 
		изминить номера ячеек внутри вронтов. Так, если я поворачиваю направо, а первый
		фронт состоял из 0.1.2.3.4.5.6.7.8.9.10.11.12.13.14, то после поворота на один ряд 
		станет 1.2.3.4.5.6.7.8.9.10.11.12.13.14.29 каждый вронт может огибать свой периметр из areaMap.*/

		var mapCol = ['#ccc', '#c00', '#0c0', '#00c'];
		var mapX = 0, mapY = 0, mapW = 15, mapH = 15;
		var mapZ = 10;

		//for (m = 0; m < 1024; m ++) {
		//	map[m] = Math.round(Math.random() * 3);
		//}
		/*Функция инициализации фронта*/
		function initFront(mas, len, str) {
			var index = str;
			for (var ini = 0; ini < len; ini ++) {
				mas[ini] = index;
				index ++;
			}
		}
		/*Функция отрисовки фронта*/
		function drawFront(mas, w, h, inter){
			for (var j = 0; j < mas.length; j ++) {
				g.fillStyle = mapCol[areaMap[mas[j]]];
				g.fillRect(j * w, inter, w - 2, h - 2);
			}
		}
		/*Инициализируем все фронты*/
		function init() {
			initFront(mF0, 15, 0);
			initFront(mF1, 13, 16);
			initFront(mF2, 11, 32);
			initFront(mF3, 9, 48);
			initFront(mF4, 7, 64);
			initFront(mF5, 5, 80);
			initFront(mF6, 3, 96);
		}
		/*Функция, вытаскивающая вдимую область из map (это не видимая область камеры!!! Но та область, в которой
		камера может поворачиваться)*/
		function mapFilter() {
			var i = 0;
			for (var y = 0; y < mapH; y ++){
				for (var x = 0; x < mapW; x ++){
					id = map[((mapY + y) << 5) + (x + mapX)];
					areaMap[i] = id;
					i ++;
					g.fillStyle = mapCol[id];
					g.fillRect(x * mapZ, y * mapZ, mapZ, mapZ);
				}
			}
		}
		/*Отрисовываем фронты*/
		function render() {
			drawFront(mF0, gW / 15, gW / 20, gH/2 + 20);
			drawFront(mF1, gW / 13, gW / 18, gH/2 + 40);
			drawFront(mF2, gW / 11, gW / 16, gH/2 + 60);
			drawFront(mF3, gW / 9, gW / 14, gH/2 + 80);
			drawFront(mF4, gW / 7, gW / 12, gH/2 + 100);
			drawFront(mF5, gW / 5, gW / 10, gH/2 + 120);
			drawFront(mF6, gW / 3, gW / 8, gH/2 + 140);
		}
		function controller() {
			if (key[39] && (mapX + mapW) < 32) {mapX += 1}
			if (key[40] && (mapY + mapW) < 32) {mapY += 1}
			if (key[37] && (mapX - 1) > 0) {mapX -= 1}
			if (key[38] && (mapY - 1) > 0) {mapY -= 1}
		}
		
		init();
		var time;
		function step() {
			requestAnimationFrame(step);
			var now = new Date().getTime(),
			dt = now - (time || now); // (любые подвижки домножаем на dt)
			time = now;
			g.clearRect(0, 0, gW, gH);
			mapFilter();
			render();
			controller();
		}
		step();
